infrastructure/experiments/haproxy_ab/roundrobin-3/ab_1000_100.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.0.2 (be patient)


Server Software:        PIB
Server Hostname:        192.168.0.2
Server Port:            8080

Document Path:          /
Document Length:        2704 bytes

Concurrency Level:      100
Time taken for tests:   1.508 seconds
Complete requests:      1000
Failed requests:        960
   (Connect: 0, Receive: 0, Length: 960, Exceptions: 0)
Total transferred:      2878318 bytes
HTML transferred:       2696318 bytes
Requests per second:    663.33 [#/sec] (mean)
Time per request:       150.755 [ms] (mean)
Time per request:       1.508 [ms] (mean, across all concurrent requests)
Transfer rate:          1864.52 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   1.5      1      10
Processing:    19  143  57.9    126     473
Waiting:       17  142  57.9    126     473
Total:         21  144  58.2    128     481

Percentage of the requests served within a certain time (ms)
  50%    128
  66%    145
  75%    162
  80%    176
  90%    222
  95%    269
  98%    316
  99%    357
 100%    481 (longest request)
